#_*_coding:utf-8_*_
#Печатать текст объясняющий, что будет делать сл.строка.
print "I will now count my chickens:"
#Совмещаю вывод текста с мат. операцией и операторами (+,/)
print "Hens ", 25 + 30 / 6
#Совмещаю вывод текста с мат. операцией и операторами (-,*,%)
print "Roosters ", 100 - 25 * 3 % 4
#Печатать текст объясняющий, что будет делать сл.строка.
print "Now I will count the eggs: "
#Вывожу результат действия с операторами(+,-,%,/)
print 3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6
#Вывести текст
print "Is it true that 3 + 2 < 5 - 7 ?"
#Вывести сравнение
print 3 + 2 < 5 - 7
#Вывести текст, а так же сумму двух чисел
print "What is 3 + 2? ", 3 + 2
#Вывести текст, а так же разность двух чисел
print "What is 5 - 7? ", 5 - 7
#Вывести текст используя экранирование
print "Oh, that\'s why it\'s false."
#Вывести текст
print "How about some more."
#Вывести текст, а так же сравнение двух чисел оператором (>)
print "Is it greater?", 5 > -2
#Вывести текст, а так же сравнение двух чисел оператором (>=)
print "Is it greater or equal?", 5 >= -2
#Вывести текст, а так же сравнение двух чисел оператором (<=)
print "Is it less or equal?", 5 <= -2

print "Hens ", 25.0 + 30.0 / 6.0
print "Roosters ", 100.0 - 25.0 * 3.0 % 4.0
print 3.0 + 2.0 + 1.0 - 5.0 + 4.0 % 2.0 - 1.0 / 4.0 +6.0
print 3.0 + 2.0 < 5.0 - 7.0
print "What is  3.0 + 2.0? ", 3.0 + 2.0
print "What is 5.0 - 7.0? ", 5.0 - 7.0
print "Is it greater? ", 5.0 > -2.0
print "Is it greater or equal? ", 5.0 >= -2.0
print "Is it less or equal? ", 5.0 <= -2.0
